Repository: samm450/tp1_prog5
Catalog: tp1/lib/l10n/intl_*.arb
Languages: fr

# apptitle
source: My Application
fr: Mon Application

# acceuil
source: Home
fr: Acceuil

# tempsEcouler
source: Percentage of used time
fr: Pourcentage de temps écoulé

# pourcentage
source: Percentage of the task
fr: Pourcentage de la tache

# pourcetangeAvancement
source: Percentage of advancement
fr: Pourcetnage de l'avancement

source: Username
fr: Nom d'utilisateur

source: Password
fr: Mot de passe

# passwordConfirmation
source: Password confirm
fr: Confirme le mot de passe

# inscription
source: Sign up
fr: Inscription

# dateDechange
source: Limited date :
fr: Date limite :

source: Name :
fr: Nom :

# pourcentageAvancement
source: Percentage of advancement :
fr: Pourcentage de l'avancement :

# pourcentageTempsEcoule
source: Percentage of used time :
fr: Pourcentage du temps utilisé :

# pickImage
source: Pick an image
fr: Choisi une image

# modification
source: Modifications has been saved
fr: Les modifications ont été enregistrées

# enregistrer
source: Save
fr: Sauvegarder

# ajoutTache
source: Add a task
fr: Ajouter une tache

# deconnexion
source: Log out
fr: Deconnexion

# creeTache
source: Create a task
fr: Créé une tache

# nomTache
source: Name of the task
fr: Nom de la tache

# noDate
source: You need to select a date
fr: Tu as besoin de sélectionner une date

# echeance
source: Due date
fr: Date due

# selectDate
source: Select a date
fr: Choisi une date

source: Add
fr: Ajouter

# NameTooShort
source: The username is too short
fr: Le nom d'utilisateur est trop court

# PasswordTooShort
source: The password is too short
fr: Le mot de passe est trop court

# PasswordMismatch
source: The passwords do not match
fr: Les mots de passe ne correspondent pas

# InvalidCredentials
source: Invalid username or password
fr: Les nom d'utilisateur ou mot de passe sont invalides

# MotDePasseTropLong
source: The password is too long
fr: Le mot de passe est trop long

# NomTropLong
source: The username is too long
fr: Le nom d'utilisateur est trop long

# UsernameTaken
source: The username is already taken
fr: Le nom d'utilisateur est déjà pris

# Existant
source: The task already exists
fr: La tache existe déjà

# TropCourt
source: The name of the task is too short
fr: Le nom de la tache est trop court

# TropLong
source: The name of the task is too long
fr: Le nom de la tache est trop long

# Vide
source: Some fields are empty
fr: des champs sont vides

# NoConnexion
source: There is no internet connection
fr: Un problème de connexion est survenu
